package com.company.AlgorithmArray;

//В этом разделе рассмотрим стандартные алгоритмы,
// которые часто используются для решения тех или иных задач, и алгоритмы сортировки массива,
// реализованные на Java.
//
//Существует достаточно много алгоритмов сортировки и их модификаций.
// Некоторые виды сортировки:
// пузырьком,
// выбором,
// вставками,
// поразрядная,
// быстрая,
// пирамидальная,
// слиянием,
// сортировка Шелла,
// топологическая,
// быстрая с составными ключами.
// Мы рассмотрим только некоторые из этих алгоритмов сортировок.


public class Info {
}
